app/Http/Controllers/HomeController.php

    public function createPresentation()
    {
        $user = Auth::user();
        if ($user->isAdmin()) {
            $teams = Team::all();
---
select * from `teams`