app/Http/Controllers/OffersController.php

    public function index(int $teamId)
    {
        $this->checkAccess($teamId);

        // Clear last search request
        $key = "offers_search_request_{$teamId}";
        if (Session::exists($key)) {
            Session::forget($key);
        }

        // Clear flash message for last search results
        if (Session::exists('status') &&
            $message = Session::get('message')) {
            if (Str::startsWith($message, 'View') ||
                Str::startsWith($message, 'There')) {
                Session::forget('status');
            }
        }

        // Current team data for view variables
        $team = Team::find($teamId);
        $team->has_choise = false;

        // Get the offers
        $queryOffer = Offer::where('team_id', $teamId)
            ->orderBy('last_update_date')
            ->with('propertys');

        // Total number offers for view variables
        $total = $queryOffer->count();
---
select * from `propertys` where `propertys`.`offer_id` in (11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select count(*) as aggregate from `offers` where `team_id` = 2

    public function selectOffer(Request $request)
    {
        $id = $request->offer_id;

        $offer = DB::table('offers')
            ->select('team_id')
            ->where('id', $id)
            ->first();
---
select `team_id` from `offers` where `id` = '12' limit 1

    public function selectProperty(Request $request)
    {
        if (is_array($request->data)) {
            $removing = true;
        }

        $id = (($removing ?? null) === true)
            ? $request->data[0]
            : $request->data;

        // Retrieve the team id for use in session key
        $property = DB::table('propertys')
            ->where('propertys.id', $id)
            ->leftJoin('offers', 'propertys.offer_id', '=', 'offers.id')
            ->select('offers.team_id')
            ->first();
---
select `offers`.`team_id` from `propertys` left join `offers` on `propertys`.`offer_id` = `offers`.`id` where `propertys`.`id` = '26' limit 1