app/View/Components/Filters/SearchFilter.php

select distinct `name` from `offers` where `team_id` = 2
select `location` from `offers` where `team_id` = 2
---
    protected function inputsData()
    {
        $inputsData = [];

        // Names data ---

        $offerName = DB::table('offers')->distinct()
            ->where('team_id', $this->teamId)
            ->pluck('name');

        if ($items = $offerName->sort()->toArray()) {
            $inputsData['offer__name'] = ['' => 'Any name...'] + $items;
        }

        // Locations data ---

        $offerLocation = DB::table('offers')
            ->where('team_id', $this->teamId)
            ->pluck('location');

select `id` from `offers` where `team_id` = 2
---
        // Property inputs data ---

        // Get the offer ids by team id
        $offers = DB::table('offers')
            ->where('team_id', $this->teamId)
            ->pluck('id');